// ***********************************************          ФУНКЦІЇ       *****************************************

// функція - програма в програмі, що створює свою власну область видимості

// ======================================Оголошення функції ==============================
// 1. Ключове слово function
// 2. Задаємо назву функції, аналогічно назві змінної
//    (придумує програміст)
// 3. Круглі дужки () для параметрів,
//    або порожні, якщо параметри не потрібні
// 4. Фігурні дужки {} для тіла функції,
//    який буде щось робити, наприклад обробляти вхідні параметри
// 5. Якщо функція має повертати результат, то
//    ключове слово return і значення, яке повертається
function showMessage() {
  console.log("Тіло функції");
}
// ============================================== Виклик функції =============================
// 1. назва функції + ()
// Без виклику функція нічого не робить
showMessage();

showMessage; // НЕ виклик функції - нема ()

console.log(showMessage); // через відсутність () у консолі буде код функції
console.log(showMessage()); // 2 рядки:
// 1. "Тіло функції", оскільки викликали функцію,
// 2.  undefined, тому що функція НІЧОГО не повертає,
// у неї немає return

// ===================ПРИКЛАД ФУНКЦІЇ без вхідних параметрів, яка повертає число ==============

function indianRandom() {
  return 42; // return - ключове слово яке забезпечує негайний вихід з функції
  // та повернення функцією вказаного значення
}
console.log('"Випадкове" число:', indianRandom()); // 42
console.log('"Випадкове" число:', indianRandom()); // 42
console.log('"Випадкове" число:', indianRandom()); // 42

// ========================================приклад функції з 1 вхідним папраметром яка НЕ повертає нічого==============

// limit - параметр функції, виконує роль локальної змінної
// (існує ЛИШЕ в межах функції)
// Після виклику функції, у змінну limit записується
// значення, яке передається під час виклику
// Після виконання тіла функції - очищується
function showRandomNumber(limit) {
  // початок тіла функції  limit 10 || 100
  console.log("Випадкове число", Math.ceil(Math.random() * limit));

  // кінець тіла функції
  // Функція нічого не повертає, тому підказка редактора коду
  // закінчується словом void
  // але console.log(showRandomNumber(10)) поверне undefined
}
//  ---------------------------виклик функції з параметром -----------

showRandomNumber(10); // 10 буде записано у "змінну" limit
showRandomNumber(10);
showRandomNumber(100);
showRandomNumber(100);

console.log(
  `Функція "showRandomNumber(10)" виконується, але повертає:`,
  showRandomNumber(10),
); // undefined

// +++++++++++++++++++++++++++++Приклад оголошення функції з 2-ма вхідними параметрами ++++++++++++++++++++++++++++++++++
// яка повертає результат обробки цих параметрів
//
// add - назва функції, придумує програміст,
//       вимоги і рекомендації як для змінної,
//       використовується для виклику функції,
//       щоб вона виконала свій код,
//       область видимості "глобальна"
// x, y - параметри функції, придумує програміст,
//        вимоги і рекомендації як для змінної,
//        область видимості "локальна" - тіло функції
function add(x, y) {
  console.log("x=:", x);
  console.log("y=:", y);

  return x + y; // повертає результат обробки параметрів
}
console.log("45+23=", add(45, 23)); // 68

const sum = add(5, 3); // Викликаємо функцію add
// для розрахунку суми чисел 5 і 3,
// результат, який повертає функція
// записуємо у змінну sum

console.log("sum=", sum);

// -----------------------Приклад оголошення функції з вхідним параметром який має значення по дефолту-------------

// функція не повертає жодного результату
// (немає ruturn, повертає undefined)
//
// name - параметр функції з значенням за замовчуванням,
// якщо під час виклику функції НЕ буде задано аргумент (значення для параметра),
// то у name буде записано "гість"
function greet(name = "гість") {
  console.log(`Привіт, ${name}`);
}
// *****************приклад виклику функції з параметром по дефолту********************

let userName;
// параметр по дефолту не знадобився
greet("Vadym"); // Привіт, Vadym
greet("Yulia"); // Привіт, Yulia
greet(""); // Привіт,
greet(null); // Привіт, null

// параметр по дефолту спрацював
greet(); //  Привіт, гість
greet(undefined); //  Привіт, гість
greet(userName); //   Привіт, гість
