const a = 10; // оголошення змінної з ініціалізацією
let b; // оголошення змінної

b = 5; // присвоєння значення 5 змінній b

// ===============Арифметичні оператори

let c = a + b;

console.log(c); // 15

c = a - b;

console.log(c); // 5
// не завжди потрібно створювати нові змінні
console.log(a * b, typeof (a * b)); // 50 number
console.log(`${a * b}`, typeof `${a * b}`); // '50' string

console.log(`${a}+${b}=${a + b}`);
console.log(`${a}-${b}=${a - b}`);
console.log(`${a}*${b}=${a * b}`);
console.log(`${a}/${b}=${a / b}`);

// --------------------------Остача від ділення

console.log(`${a} % ${b}= ${a % b}`); // 0:10 = 5+5+0
console.log(`${b} % ${a}= ${b % a}`); // 5 = 10-5
console.log(`${a} % 3= ${a % 3}`); // 1:10 = 3+3+3+1

console.log(`5%2 = ${5 % 2}`); // 1 - не парне число
console.log(`4%2 = ${4 % 2}`); // 0 - парне число

// ---------------------Піднесення до степення

console.log(`${a}**${b} = ${a ** b}`); // 100_000
console.log(`2 в степені 3 = ${2 ** 3}`); // 8
console.log(`10 в степені 2 = ${10 ** 2}`); // 100

// Для арифметичних операцій діє математичний пріоритет
// Операції можна групувати за допомогою дужок

console.log(`2+2*2 = ${2 + 2 * 2}`); // 6
console.log(`(2+2)*2 = ${(2 + 2) * 2}`); // 8

const x = "42";
const y = "18";

console.log(` Rонстанта x =${x}, x=${x}, тип: ${typeof x}`);
console.log(` Rонстанта a =${a}, x=${a}, тип: ${typeof a}`);

console.log(`${x}+${y} = ${x + y}`); // 4218
console.log(`${x}+${a} = ${x + a}`); // 4210 : "42" + 10 = "42" +"10" ="4210"
console.log(`${a}+${y} = ${a + y}`); // 1018

// Для рядків в JS оператор "+" виконує операцію
// "конкатенацію" (об'єднання, склеювання)
// Якщо один зі складових виразу НЕ рядок,
// тоді JS спробує перетворити його на рядок (неявне перетворення типів)

// --------------------Неявне перетворення типів

console.log(x + a); // "4210" : якщо "рядок + число", то число -> рядок
console.log(a + x); // "1042" : якщо "число + рядок", то число -> рядок
console.log(a * y); // 180 : якщо "число * рядок", то рядок (намагається) -> число, інакше NaN
console.log(y * a); // 180 : якщо "рядок * число", то рядок (намагається) -> число, інакше NaN
console.log(a / y); // 0.555 : якщо "число / рядок", то рядок (намагається) -> число, інакше NaN
console.log(y / a); //   1.8 : якщо "рядок / число", то рядок (намагається) -> число, інакше NaN
console.log(a - y); // -8 : якщо "число - рядок", то рядок (намагається) -> число, інакше NaN
console.log(y - a); //  8 : якщо "рядок - рядок", то рядок (намагається) -> число, інакше NaN

// ========================оператори присвоєння

let q = 5; // присвоєння значення для змінної "q"
q = q + 3; // q = 8

q = q + 3; // q = 11

let w = 5;

w = w - 3; // w = 2
w = w - 3; // w = -1

// скорочений запис

q = 5;
q += 3; // тотожго запису q = q + 3
console.log(`q=${q}`); // q = 8

q += 3;
console.log(`q=${q}`); // q = 11

// Віднімання
w = 5;

w -= 3; // тотожго запису w = w - 3
console.log(`w=${w}`);
w -= 3;
console.log(`w=${w}`);

// Множення

let m = 4;

m = m * 5; // Звичайне Множення на 5
m *= 5; // скорочений запис Множення

// Ділення змінної m  на 2

m = m / 2; // Звичайне ділення
m /= 2; // скорочений варіант

// ============================Оператори інкременту та дикременту

let i = 8;

// способи збільшення значення змінної на 1 - інкремент

i = i + 1; // Звичайний (i=8+1 =9)
i += 1; // скорочений (i=9+1 = 10)
i++; // оператор інкременту(постфіксний) (i=10+1 = 11)

// Принцип дії
// 1. Береться поточне значення змінної
// 2. Рахується вираз у правій частині
// 3. Результат записується у ліву частину (оновлюється значення змінної)

console.log(`i=${i}`); // 11

// постфіксний оператор

let j = 7;
console.log(`j=${j++}`); // j=7

// постфіксний оператор спочатку повертає поточне значення потім збільшує його на 1
console.log(`j=${j}`); // j=8

// Префіксний оператор
let k = 7;
console.log(`k=${++k}`); // k=8
// префіксний оператор спочатку збільшує поточне значення на 1
// потім повертає вже оновлене значення
console.log(`k=${k}`); // k=8
