// alert("Діалогове вікно з повідомленням");

// Записуємо у змінну значення, яке ввів користувач і натиснув ОК
// або "Значення за замовчуванням", якщо просто натиснув ОК
// або null, якщо натиснув Скасувати
const answerWithDefault = prompt(
  "Повідомлення" /* Підпис для діалогового вікна (над полем введення) */,
  "Значення за замовчуванням" /* Вміст для поля введення */,
);

console.log("Відповідь користувача:", answerWithDefault);

const answerNoDefault = prompt("Введіть текст");

console.log(
  "Відповідь користувача без значення за замовчуванням",
  `>${answerNoDefault}<`,
  "тип змінної:",
  typeof answerNoDefault,
);

// якщо користувач нічого не введе і натисне"ок" то у змінну запишеться пустий рядок " "

const userNumber = prompt("Виберіть число від 1 до 20", "10");

console.log("Число користувача", userNumber, "має тип:", typeof userNumber);
const someNumber = 14;
console.log(
  "Сума числа користувача і деякого іншого числа",
  userNumber + someNumber,
); // 1014

// якщо результат prompt - рядок(напр 12) то js перетворює число someNumber в рядок і воконує об'єднання тому 12+14 = 1214 а не 26
// Якщо результат prompt - null,
// то JS перетворить null в 0,
// тоді результат = 0 + 14 = 14

// Для виконання операції + js за бкдь якого сцкнарію дій користувача - виконає наявне перетворення типів

//=========================== Явне перетворення типів

const convertedUserNumber = Number(userNumber); // Рядок => у число string у number

console.log(
  'Сума "обробленого" числа користувача і деякого іншого числа',
  convertedUserNumber + someNumber,
); // 26

// перевірка дій користувача - мета відслідкувати натискання кнопки -"Скасувати"

const userMonth = prompt("Введіть номер місяця, у якому народилися");


// Перевірка
// Умовний оператор
// Якщо значення змінної  userMonth = null, тоді виводимо повідомлення з подякою і завершуємо роботу
if (userMonth==null) {
    alert("Дякуємо за ваш час!")
                        //   інакше користувач натиснув"ok" - 
                        // тоді дякуємо і перетворюємо введене значення або " "
                        // на число
} else {                       
    console.log("Дякуємо за відвертість", Number(userMonth));
    
}
