// оператори порівняння
// результат ---- значення лргічного типу(boolean - true або false)


// Більше
console.log(`5>3:`,5>3);    // true
console.log(`3>5:`,3>5);      // false

// менше
console.log(`5<3:`,5<3);   // false
console.log(`3<5:`,3<5);    // true

// більшеабодорівнює
console.log(`5>=3:`,5>=3);   // true
console.log(`3>=5:`,3>=5);    // false
console.log(`4>=4:`,4>=4);    // true


// менше або дорівнює

console.log(`5<=3:`,5<=3);     // false
console.log(`3<=5:`,3<=5);     // true
console.log(`4<=4:`,4<=4);     // true


// неявне перетворення типів

console.log(`"5" <= 3:`, "5" <= 3); // false
console.log(`4 > "3":`, 4 > "3"); // true
console.log(`"-3" > "2":`, "-3" > "2"); // false
console.log(`"-3" <= "2":`, "-3" <= "2"); // true
console.log(`true <= "2":`, true <= "2"); // true
console.log(`true <= null:`, true <= null); // false

// JS намагається перетворити обидві частини виразу у число і потім порівняти їх


// ====не дорівнює(!=)

console.log(`5!=3:`,5!=3);     // true
console.log(`4!=4:`,4!=4);     // false

// не строге порівняння на рівність значень(==)

// спочатку аналізуються ліва і права частини(між==),
// за потреби відбувається неявне перетворення типів, 
// після того відбувається порівняння значень

console.log(`3 == 3:`, 3 == 3); // true
console.log(`3 == 4:`, 3 == 4); // false
console.log(`5 == "5":`, 5 == "5"); // true
console.log(`5 == "4":`, 5 == "4"); // false

// строге порівняння на рівність значення (===)
// 
// важливі типи аргументів(ліва і права частини)
// спочатку перевіряються типи лівої та правої частини
// (typeof<ліва частина> ===  typeof<права частина>)
// за результптпми якої приймається рішення:
// - якщо типи НЕ співпадають то одразу повертається false
// - значення ігноруються

// - ІНАКШЕ (типи співпадають) переходимо до порівняння значень
console.log(`3 === 3:`, 3 === 3); // true: типи однакові значення рівні
console.log(`3 === 4:`, 3 === 4); // false: типи однокові значення -ні
console.log(`5 === "5":`, 5 === "5"); // false: значення однакові типи - ні(значення не важливі бо типи різні)
console.log(`5 === "4":`, 5 === "4"); // false типи різні - значення не важливі

// рекомендація з замовчуванням надавати перевагу строгому порівнянню значень,
// иожливе виключення для порівняння з null
// змінна == null одночасно перевіряє рівність з undefined


// Логічні оператори

// i (&&)
// Вимагає виконання (значення true) обох частин виразу
// <ліва частина = true> && <права частина = true> -> true
// <ліва частина = false> && <права частина = true> -> false
// <ліва частина = true> && <права частина = false> -> false
// <ліва частина = false> && <права частина = false> -> false
console.log(`(5 > 3) && (6 < 7)`, 5 > 3 && 6 < 7); // true: true && true
console.log(`(5 < 3) && (6 < 7)`, 5 < 3 && 6 < 7); // false: <ліва частина> = false, права - не важливо
console.log(`(5 > 3) && (6 > 7)`, 5 > 3 && 6 > 7); // false: true && false
console.log(`(5 < 3) && (6 > 7)`, 5 < 3 && 6 > 7); // false: <ліва частина> = false, права - не важливо


// АБО (||) [| = ENG -> Shift + \]
// Вимагає виконання (значення true) БУДЬ-ЯКОЇ частини виразу
// <ліва частина = true> || <права частина = true> -> true
// <ліва частина = false> || <права частина = true> -> true
// <ліва частина = true> || <права частина = false> -> true
// <ліва частина = false> || <права частина = false> -> false
console.log(`(5 > 3) || (6 < 7)`, 5 > 3 || 6 < 7); // true: <ліва частина> = true, права - не важливо
console.log(`(5 < 3) || (6 < 7)`, 5 < 3 || 6 < 7); // true: <ліва частина> = false, <ліва частина> = true
console.log(`(5 > 3) || (6 > 7)`, 5 > 3 || 6 > 7); // true: <ліва частина> = true, права - не важливо
console.log(`(5 < 3) || (6 > 7)`, 5 < 3 || 6 > 7); // false: false || false


// НЕ (!)
// Змінює значення логічного типу на протилежне
// !true -> false
// !false -> true
console.log(`!true:`, !true); // false: НЕ правда -> брехню
console.log(`!false:`, !false); // true: НЕ брехня -> правду
console.log(`!(3 > 5)`, !(3 > 5)); // true: !(брехня) -> НЕ брехня -> правда
console.log(`!(3 < 5)`, !(3 < 5)); // false: !(правда) -> НЕ правда -> брехня

// !(3 > 5) не рекомендовано використовувати
// за можливості краще замінити на (3 < 5)


// приклади зі змінними
const a = 10;
const b = -4;
const c = "8";
const d = true;

console.log(`a > b`, a > b); // true
console.log(`a >= c`, a >= c); // true: 10 >= "10" -> 10 >= 10

// не строге порівняння на нерівність,
// відбувається неявне перетворення типів
console.log(`a != c`, a != c); // false: 10 != "10" -> 10 != 10

// строге порівняння на нерівність,
// спочатку порівнюються типи
console.log(`a !== c`, a !== c); // true:
// typeof a ? typeof c -> typeof 10 ? typeof "10" -> 'number' ? 'string' ->
// -> типи різні -> true

console.log(`c == a`, c == a); // true, не строга перевірка, не явне перетворення типів
console.log(`c === a`, c === a); // false, строга перевірка, типи - різні

console.log(`c > a && d`, c > a && d); // false:
// "10" > 10 && true -> 10 > 10 && true -> false, true - ігнорується

console.log(`d > a || d`, d > a || d); // true:
// true > 10 || true -> 1 > 10 || true -> false || true

