<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>
</head>

<body>
    <h2>Основи PHP</h2>
    <p>Використання PHP вставки в HTML</p>
    <p>
        <?php
        echo "Hello world!";
        $num = rand(1, 100);
        $num *= 3;   //
        ?>
    </p>
    <p>
        <?= $num ?>
    </p>
    <p>
        <?php
        include __DIR__ . '/osnovy.php';

        // include - якщо виникне помилка -видасть попередження, але скрипт працюватиме далі
        // Підключення щоразу 
        // ******************************************************************
        // require - якщо виникне помилка - скрипт зупиниться
        // Підключення щоразу
        // ******************************************************************
         // include_once - якщо виникне помилка -видасть попередження, але скрипт працюватиме далі
        // Підключення 1 раз 
        // ******************************************************************
        // require_once - якщо виникне помилка - скрипт зупиниться
        // Підключення 1 раз (підключення конфігурацій, бібліотек, класів)
        // ******************************************************************
        ?>
    </p>
    <h5>Кінець сторінки</h5>
</body>

</html>