<?php

for ($i = 1; $i <= 10; $i++) {
    echo " $i ";
}

echo "<br>";
// Вивести 10 випадкових чисел
for ($i = 1; $i <= 10; $i++) {
    echo rand(1, 20) . ", ";
}
echo "<br><br>";

// *******************************цикл while (вивід непарних чисел до 20)
$num = 1;
while ($num < 20) {
    echo "$num, ";
    $num += 2;  //обов'язково для завершення циклу
}
echo "<br><br>";
// Порахувати суму чисел від 15 -24
$suma = 0;
$i = 15;
while ($i <= 24) {
    $suma += $i;
    $i++;   ///обов'язково для завершення циклу
}
echo "Suma(15-24):$suma";
// розрив у 2 рядки
echo "<br><br>";

// ***********************************цикл do-while 
// (згенерувати набір випадкових чисел від 1-40)
// зупинити цикл якщо випаде число більше 25
do {
    $random = rand(1, 40);
    echo "$random, ";
} while ($random <= 25);
echo "<br><br>";
// break - перериває виконання циклу та виконується код після/за циклу(ом) нижче
// continue -перериваєпоточний виток циклу та відразу переходить до наступного


// ******************* цикл for + if ********************************************

// згенерувати набір  з 20 випадкових чисел в межах від 1 -40
// зупинити цткл раніше якщо випаде число більше рівне 35, (break)
// якщо випаде парне число - не виводити його (continue)
$count_continue = 0;
for ($i = 1; $i <= 20; $i++) {
    $random = rand(1, 40);
    if ($random % 2 === 0) {
        $count_continue++;
        continue;
    }
    echo "$random, ";
    if ($random >= 35) {
        break;
    }
}
echo "<br>Кількість пропусків: $count_continue";
